status/2021/28may21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>22 May 2021 - 28 May 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">22 May 2021 - 28 May 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ddbcd3">1. Linux Audio</a>
<ul>
<li><a href="#org68839ff">1.1. Faust programming</a>
<ul>
<li><a href="#org13ce928">1.1.1. GAC hand-created application complete</a></li>
<li><a href="#org2b916ad">1.1.2. GAC code generator started</a></li>
</ul>
</li>
<li><a href="#org1a754e6">1.2. Next Steps</a>
<ul>
<li><a href="#org91a5bd5">1.2.1. Analog Synthesizer modules</a></li>
<li><a href="#org9fd6edf">1.2.2. Waveshaper</a></li>
<li><a href="#org6862f43">1.2.3. LV2 autopatcher</a></li>
<li><a href="#org1f75523">1.2.4. OSC control surface</a></li>
<li><a href="#org524a78a">1.2.5. Faust/csound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org36c7b8e">2. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org4746ff6">2.1. Next step</a>
<ul>
<li><a href="#org533100c">2.1.1. Check replacement sensor</a></li>
<li><a href="#org81e07b0">2.1.2. Clean BME680/VELM6075 boards</a></li>
<li><a href="#orge124c5a">2.1.3. Design more robust instrument shelter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfc4fc1b">3. EPICS</a>
<ul>
<li><a href="#org2447b69">3.1. Next steps</a>
<ul>
<li><a href="#org27eecef">3.1.1. u3scpi network port testing</a></li>
<li><a href="#org17196c8">3.1.2. initial EPICS interface</a></li>
<li><a href="#org43f9414">3.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org658674e">4. Brini Tracker II</a>
<ul>
<li><a href="#orgcfff3b1">4.1. Next steps</a>
<ul>
<li><a href="#org1b2ee5f">4.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgc0ef4e4">4.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org68e06a9">4.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8f7f5e5">5. wktcolor</a>
<ul>
<li><a href="#org5c91187">5.1. Next steps</a>
<ul>
<li><a href="#org5bce97d">5.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd8d7c4f">6. wktplot</a>
<ul>
<li><a href="#org5e3cb08">6.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org35a8f22">7. ca-r</a>
<ul>
<li><a href="#org5b40bb6">7.1. Had yet another 'ca-tier' change</a></li>
<li><a href="#orga18f53b">7.2. Next Step</a></li>
</ul>
</li>
<li><a href="#org19ccee9">8. AMDGPU</a>
<ul>
<li><a href="#org88f8855">8.1. Next step</a>
<ul>
<li><a href="#orgbdf175f">8.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc7fc36d">9. Ninja v Make</a>
<ul>
<li><a href="#org24c4451">9.1. Next Step</a>
<ul>
<li><a href="#orgcec5c78">9.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org47f1238">10. Conical Rolling Pin</a>
<ul>
<li><a href="#org944def4">10.1. Next Step</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Last week of 'Audio Push Month'
</p>

<div id="outline-container-org1ddbcd3" class="outline-2">
<h2 id="org1ddbcd3"><span class="section-number-2">1.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org68839ff" class="outline-3">
<h3 id="org68839ff"><span class="section-number-3">1.1.</span> Faust programming</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org13ce928" class="outline-4">
<h4 id="org13ce928"><span class="section-number-4">1.1.1.</span> GAC hand-created application complete</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Some problems with 'amp' argument order
</p>
</div>
</div>
<div id="outline-container-org2b916ad" class="outline-4">
<h4 id="org2b916ad"><span class="section-number-4">1.1.2.</span> GAC code generator started</h4>
</div>
</div>
<div id="outline-container-org1a754e6" class="outline-3">
<h3 id="org1a754e6"><span class="section-number-3">1.2.</span> Next Steps</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org91a5bd5" class="outline-4">
<h4 id="org91a5bd5"><span class="section-number-4">1.2.1.</span> Analog Synthesizer modules</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Finish GAC generator
</p>
</div>
</div>
<div id="outline-container-org9fd6edf" class="outline-4">
<h4 id="org9fd6edf"><span class="section-number-4">1.2.2.</span> Waveshaper</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Starting with set of Chebyshev polynomials. Playing around with Gray coding
to iterate through polynomial set.
</p>
</div>
</div>
<div id="outline-container-org6862f43" class="outline-4">
<h4 id="org6862f43"><span class="section-number-4">1.2.3.</span> LV2 autopatcher</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</div>
<div id="outline-container-org1f75523" class="outline-4">
<h4 id="org1f75523"><span class="section-number-4">1.2.4.</span> OSC control surface</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</div>
<div id="outline-container-org524a78a" class="outline-4">
<h4 id="org524a78a"><span class="section-number-4">1.2.5.</span> Faust/csound</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
See if a faust generated unit works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org36c7b8e" class="outline-2">
<h2 id="org36c7b8e"><span class="section-number-2">2.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4746ff6" class="outline-3">
<h3 id="org4746ff6"><span class="section-number-3">2.1.</span> Next step</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org533100c" class="outline-4">
<h4 id="org533100c"><span class="section-number-4">2.1.1.</span> Check replacement sensor</h4>
</div>
<div id="outline-container-org81e07b0" class="outline-4">
<h4 id="org81e07b0"><span class="section-number-4">2.1.2.</span> Clean BME680/VELM6075 boards</h4>
</div>
<div id="outline-container-orge124c5a" class="outline-4">
<h4 id="orge124c5a"><span class="section-number-4">2.1.3.</span> Design more robust instrument shelter</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Use existing small mast for VEML6075; put others in larger shelter.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfc4fc1b" class="outline-2">
<h2 id="orgfc4fc1b"><span class="section-number-2">3.</span> EPICS</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2447b69" class="outline-3">
<h3 id="org2447b69"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org27eecef" class="outline-4">
<h4 id="org27eecef"><span class="section-number-4">3.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org17196c8" class="outline-4">
<h4 id="org17196c8"><span class="section-number-4">3.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org43f9414" class="outline-4">
<h4 id="org43f9414"><span class="section-number-4">3.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org658674e" class="outline-2">
<h2 id="org658674e"><span class="section-number-2">4.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-4">
<p>
Still working!
</p>
</div>
<div id="outline-container-orgcfff3b1" class="outline-3">
<h3 id="orgcfff3b1"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org1b2ee5f" class="outline-4">
<h4 id="org1b2ee5f"><span class="section-number-4">4.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgc0ef4e4" class="outline-4">
<h4 id="orgc0ef4e4"><span class="section-number-4">4.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org68e06a9" class="outline-4">
<h4 id="org68e06a9"><span class="section-number-4">4.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org8f7f5e5" class="outline-2">
<h2 id="org8f7f5e5"><span class="section-number-2">5.</span> wktcolor</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5c91187" class="outline-3">
<h3 id="org5c91187"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org5bce97d" class="outline-4">
<h4 id="org5bce97d"><span class="section-number-4">5.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8d7c4f" class="outline-2">
<h2 id="orgd8d7c4f"><span class="section-number-2">6.</span> wktplot</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org5e3cb08" class="outline-3">
<h3 id="org5e3cb08"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>

<div id="outline-container-org35a8f22" class="outline-2">
<h2 id="org35a8f22"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org5b40bb6" class="outline-3">
<h3 id="org5b40bb6"><span class="section-number-3">7.1.</span> Had yet another 'ca-tier' change</h3>
</div>
<div id="outline-container-orga18f53b" class="outline-3">
<h3 id="orga18f53b"><span class="section-number-3">7.2.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-2">
<p>
None
</p>
</div>
</div>
</div>

<div id="outline-container-org19ccee9" class="outline-2">
<h2 id="org19ccee9"><span class="section-number-2">8.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org88f8855" class="outline-3">
<h3 id="org88f8855"><span class="section-number-3">8.1.</span> Next step</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgbdf175f" class="outline-4">
<h4 id="orgbdf175f"><span class="section-number-4">8.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orgc7fc36d" class="outline-2">
<h2 id="orgc7fc36d"><span class="section-number-2">9.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org24c4451" class="outline-3">
<h3 id="org24c4451"><span class="section-number-3">9.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgcec5c78" class="outline-4">
<h4 id="orgcec5c78"><span class="section-number-4">9.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org47f1238" class="outline-2">
<h2 id="org47f1238"><span class="section-number-2">10.</span> Conical Rolling Pin</h2>
<div class="outline-text-2" id="text-10">
<p>
Conical Rolling pin worked great except the sharp point dug into the
dough.  Point isn't necessary.
</p>
</div>
<div id="outline-container-org944def4" class="outline-3">
<h3 id="org944def4"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Soften point.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
